Tekla Open API Reference for Tekla Structures 2025
StructuresInstallation.EnvBaseFolder Property
 Gets Path to Tekla Structures XSDATADIR directory. XSDATADIR is defined in the teklastructures.ini file. It points to a location, where the installation installs the environment files and folders. Example: C:\ProgramData\Trimble\Tekla Structures\Version
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static string EnvBaseFolder { get; }
Public Shared ReadOnly Property EnvBaseFolder As String
	Get
Property Value
Type: String
See Also
Reference
StructuresInstallation Class
Tekla.Structures.Dialog Namespace